/*******************************************************************************

              Copyright (С) 2012 Юрий Владимирович Круглов

   Эта программа является свободным программным обеспечением. Вы можете
   распространять и/или  модифицировать её согласно условиям Стандартной
   Общественной Лицензии GNU, опубликованной Организацией Свободного
   Программного Обеспечения, версии 3, либо по Вашему желанию, любой более
   поздней версии.

   Эта программа распространяется в надежде на то, что окажется полезной, но
   БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ, даже без подразумеваемых гарантий ОКУПАЕМОСТИ или
   СООТВЕТСТВИЯ КОНКРЕТНЫМ ЦЕЛЯМ.
   Подробнее - см. Стандартной Общественную Лицензию GNU.

   Вы должны были получить копию Основной Общественной Лицензии GNU вместе с
   этой программой. При её отсутствии обратитесь на сайт
   http://www.gnu.org/licenses/.

********************************************************************************

                   Copyright (C) 2012 Yuri V. Krugloff

   This program is free software: you can redistribute it and/or modify it
   under the terms of the GNU General Public License as published by the Free
   Software Foundation, either version 3 of the License, or (at your option)
   any later version.

   This program is distributed in the hope that it will be useful, but
   WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
   or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
   more details.

   You should have received a copy of the GNU General Public License
   along with this program. If not, see <http://www.gnu.org/licenses/>.

*******************************************************************************/

#include "Command.hpp"

//------------------------------------------------------------------------------

/*!
   Описание параметров команд.

   cmdNoOp
   Допустимы любые значения параметров. Все параметры игнорируются.

   cmdNewFile
       ObjName Имя файла относительно начального каталога.
       Size    Размер файла. Если размер файла неизвестен, в данном параметре
               можно передать любое отрицательное число.
       Stat    Игнорируется.

   cmdNewDir
       ObjName Имя каталога относительно начального каталога.
       Size    Игнорируется.
       Stat    Игнорируется.

   cmdWriteBlock
   Данная команда не имеет параметров. Объект, получивший данную команду должен
   считывать данные из ячейки кольцевого буфера. Указатель на данные и размер
   ячейки он должен получить из экземпляра объекта класса \c TBufferCell.
   В целях проверки корректности можно в параметре ObjName передавать имя файла.
       ObjName Игнорируется.
       Size    Игнорируется.
       Stat    Игнорируется.

   cmdCloseFile
   Данная команда сигнализирует, что обработчик должен закрыть ранее открытый
   файл. Также содержит функциональность команды cmdWriteBlock. Объект,
   получивший данную команду должен вначале считать данные из ячейки кольцевого
   буфера. Объём занятого в ячейке пространства может быть равен нулю.
   Параметр Size - результирующий размер файла. Если размер,
   переданный в данной команде, не совпадает с размером файла, получившимся у
   обработчика, тот может удалить такой файл, посчитав его "плохим". Если
   в параметре передано отрицательное число, предполагается, что размер файла
   неизвестен.
   Каждая команда cmdCloseFile должна соответствовать команде cmdNewFile.
   В целях проверки корректности можно в параметре ObjName передавать имя файла.
       ObjName Игнорируется.
       Size    Результирующий размер файла.
       Stat    Игнорируется.

    cmdSetFileStat
       ObjName
       Size
       Stat

    cmdSetDirStat
       ObjName
       Size
       Stat

    cmdUncompleteFile
       ObjName
       Size
       Stat

    cmdEnd
       ObjName
       Size
       Stat

 */

//------------------------------------------------------------------------------
//! Конструктор.

TCommandData::TCommandData()
    : Size(-1)
{
}

//------------------------------------------------------------------------------
//! Очистка.

void TCommandData::clear()
{
    Size = -1;
    ObjName.clear();
    Stat.clear();
}

//------------------------------------------------------------------------------
